<a href="https://colab.research.google.com/github/haseebkhan611/HDL-Bits-Solutions/blob/master/Titanic_Kaggle_V1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from google.colab import files

In [2]:
# dataset=pd.read_csv('Data.csv')
# uploaded = files.upload()
data=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')
test_ids = test["PassengerId"]

In [3]:
# data.head()
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [4]:
# This step will delete all the irrelevant data columns from the set. For e.g. ["Ticket","Cabin","Name","PassengerId"]
# It will also replace the numerical data with a median value

In [5]:
def clean(data):
  data=data.drop(["Ticket","Cabin","Name","PassengerId"],axis=1)
  cols=["SibSp","Parch","Fare","Age"]
  for i in cols:
    data[i].fillna(data[i].median(),inplace=True)
  data.Embarked.fillna("U",inplace=True)
  return data

data=clean(data)
test=clean(test)

In [6]:
# This code will change the data from string into numbers. For e.g. male is 1 and female is 0 under Column "Sex".

from sklearn import preprocessing
le=preprocessing.LabelEncoder()

cols=["Sex","Embarked"]

for col in cols:
  data[col]=le.fit_transform(data[col])
  
  test[col]=le.transform(test[col])
  print(le.classes_)

# data.head(5)
test.head(5)

['female' 'male']
['C' 'Q' 'S' 'U']

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  34.5      0      0   7.8292         1
1       3    0  47.0      1      0   7.0000         2
2       2    1  62.0      0      0   9.6875         1
3       3    1  27.0      0      0   8.6625         2
4       3    0  22.0      1      1  12.2875         2

In [7]:
### 3. Splitting the training set data into test and train 

from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

y=data["Survived"]
X=data.drop("Survived",axis=1)

X_train, X_val,y_train,y_val=train_test_split(X,y,test_size=0.2,random_state=42)

In [8]:
clf=LogisticRegression(random_state=0,max_iter=1000).fit(X_train,y_train)

In [9]:
 predictions=clf.predict(X_val)
 from sklearn.metrics import accuracy_score
 accuracy_score(y_val,predictions)

0.8100558659217877

In [10]:
submission_preds=clf.predict(test)

In [11]:
df = pd.DataFrame({"PassengerId": test_ids.values,
                   "Survived": submission_preds,
                  })

In [12]:
df.to_csv("submission.csv", index=False)